/*
 * Decompiled with CFR 0.152.
 */
package Client;

public enum MapleExpStat {
    活動獎勵經驗值(1L),
    怪物額外經驗值(2L),
    活動組隊經驗值(8L),
    組隊額外經驗值(16L),
    結婚紅利經驗值(32L),
    道具裝備紅利經驗值(64L),
    高級服務贈送經驗值(128L),
    彩虹週獎勵經驗值(256L),
    爆發獎勵經驗值(512L),
    秘藥額外經驗值(1024L),
    極限屬性經驗值(2048L),
    加持獎勵經驗值(4096L),
    休息獎勵經驗值(8192L),
    道具獎勵經驗值(16384L),
    道具名經驗值(32768L),
    依道具趴增加經驗值(65536L),
    超值包獎勵經驗值(131072L),
    依道具的組隊任務趴增加經驗值(262144L),
    累積狩獵數紅利經驗值(524288L),
    家族經驗值獎勵(0x100000L),
    冷凍勇士經驗值獎勵(0x200000L),
    燃燒場地獎勵經驗(0x400000L),
    HP風險經驗值(0x800000L),
    場地紅利經驗(0x1000000L),
    累計打獵數量獎勵經驗(0x2000000L),
    活動獎勵經驗值2(0x4000000L),
    網咖摯友獎勵經驗值(0x8000000L),
    場地紅利經驗2(0x10000000L),
    超級小豬幸運_攻擊額外經驗值(0x20000000L),
    伺服器計量條活動獎勵經驗值(0x40000000L),
    未知2(0x80000000L),
    組隊經驗值增加x趴(0x100000000L),
    蛋糕vs派餅_EXP紅利(0x200000000L),
    Pvp_Bonus_EXP(0x400000000L),
    寵物訓練紅利經驗值(0x800000000L),
    組合道具獎勵經驗值(0x1000000000L),
    組合道具獎勵組隊經驗值(0x2000000000L),
    伺服器加持經驗值(0x4000000000L),
    累積狩獵數紅利經驗值2(0x8000000000L),
    艾爾達斯還原追加經驗值(0x10000000000L);

    private final long flag;

    private MapleExpStat(long flag) {
        this.flag = flag;
    }

    public long getFlag() {
        return this.flag;
    }
}

